{
  "metadata": {
    "title": "The Giver",
    "author": "Lois Lowry",
    "edition": "Houghton Mifflin, 1993",
    "creation_date": "2025-11-21T22:01:13.612351",
    "protocol_version": "3.3"
  },
  "extracts": {
    "exposition": {
      "chapter_range": "1-4",
      "primary_chapter": 2,
      "text": "It was almost December, and Jonas was beginning to be frightened. No. Wrong word, Jonas thought. Frightened meant that deep, sickening feeling of something terrible about to happen. Frightened was the way he had felt a year ago when an unidentified aircraft had overflown the community twice. He had seen it both times. Squinting toward the sky, he had seen the sleek jet, almost a blur at its high speed, go past, and a second later heard the blast of sound that followed. Then one more time, a moment later, from the opposite direction, the same plane. At first, he had been only fascinated. He had never seen aircraft so close, for it was against the rules for Pilots to fly over the community. Occasionally, when supplies were delivered by cargo planes to the landing field across the river, the children rode their bicycles to the riverbank and watched, intrigued, the unloading and then the takeoff directed to the west, always away from the community. But the aircraft a year ago had been different. It was not a squat, fat-bellied cargo plane but a needle-nosed single-pilot jet. Jonas, looking around anxiously, had seen others—adults as well as children—stop what they were doing and wait, confused, for an explanation of the frightening event.",
      "rationale": "This opening establishes Jonas as the protagonist, introduces the controlled community setting, and creates initial tension around the upcoming December ceremony while demonstrating the community's rigid rules and order.",
      "word_count": 236
    },
    "rising_action": {
      "chapter_range": "5-11",
      "primary_chapter": 8,
      "text": "Jonas watched as his father poured a fresh cup of coffee. He waited. 'You know,' his father finally said, 'every December was exciting to me when I was young. And it has been for you and Lily, too, I'm sure. Each December brings such changes.' Jonas nodded. He could remember the Decembers back to when he had become, well, probably a Four. The earlier ones were lost to him. But he observed them each year, and he remembered Lily's earliest Decembers. He remembered when his family received Lily, the day she was named, the day that she had become a One. The Ceremony for the Ones was always noisy and fun. Each December, all the newchildren born in the previous year turned One. One at a time—there were always fifty in each year's group, if none had been released—they had been brought to the stage by the Nurturers who had cared for them since birth. Some were already walking, wobbly on their unsteady legs; others were no more than a few days old, wrapped in blankets, held by their Nurturers. 'I enjoy the Naming,' Jonas said. His mother agreed, smiling. 'The year we got Lily, we knew, of course, that we'd receive our female, because we'd made our application and been approved. But I'd been wondering and wondering what her name would be.'",
      "rationale": "This section builds anticipation for Jonas's Assignment ceremony while revealing the community's system of family units, ceremonies, and controlled reproduction, establishing the world-building that will become crucial later.",
      "word_count": 262
    },
    "climax": {
      "chapter_range": "12",
      "primary_chapter": 12,
      "text": "'Do you mean that now you don't have the memory of it—of that ride on the sled—anymore?' 'That's right. A little weight off this old body.' 'But it was such fun! And now you don't have it anymore! I took it from you!' But the old man laughed. 'All I gave you was one ride, on one sled, in one snow, on one hill. I have a whole world of them in my memory. I could give them to you one by one, a thousand times, and there would still be more.' 'Are you saying that I—I mean we—could do it again?' Jonas asked. 'I'd really like to. I think I could steer, by pulling the rope. I didn't try this time, because it was so new.' The old man, laughing, shook his head. 'Maybe another day, for a treat. But there's no time, really, just to play. I only wanted to begin by showing you how it works.' 'Now,' he said, turning businesslike, 'lie back down. I want to—' Jonas did. He was eager for whatever experience would come next. But he had, suddenly, so many questions. 'Why don't we have snow, and sleds, and hills?' he asked. 'And when did we, in the past? Did my parents have sleds when they were young? Did you?' The old man shrugged and gave a short laugh. 'No,' he told Jonas. 'It's a very distant memory. That's why it was so exhausting—I had to tug it forward from many generations back.'",
      "rationale": "This represents the turning point where Jonas first receives memories and begins to understand what has been taken from his community, marking the moment his worldview fundamentally shifts.",
      "word_count": 315
    },
    "falling_action": {
      "chapter_range": "13-19",
      "primary_chapter": 16,
      "text": "'I won't! I won't go home! You can't make me!' Jonas sobbed and shouted and pounded the bed with his fists. 'Sit up, Jonas,' The Giver told him firmly. Jonas obeyed him. Weeping, shuddering, he sat on the edge of the bed. He would not look at The Giver. 'You may stay here tonight. I want to talk to you. But you must be quiet now, while I notify your family unit. No one must hear you cry.' Jonas looked up wildly. 'No one heard that little twin cry, either! No one but my father!' He collapsed in sobs again. The Giver waited silently. Finally Jonas was able to quiet himself and he sat huddled, his shoulders shaking. The Giver went to the wall speaker and clicked the switch to ON. 'Yes, Receiver. How may I help you?' 'Notify the new Receiver's family unit that he will be staying with me tonight, for additional training.' 'I will take care of that, sir. Thank you for your instructions,' the voice said. 'I will take care of that, sir. I will take care of that, sir,' Jonas mimicked in a cruel, sarcastic voice. 'I will do whatever you like, sir. I will kill people, sir. Old people? Small newborn people? I'd be happy to kill them, sir. Thank you for your instructions, sir. How may I help y—' He couldn't seem to stop. The Giver grasped his shoulders firmly. Jonas fell silent and stared at him. 'Listen to me, Jonas. They can't help it. They know nothing.'",
      "rationale": "This section shows Jonas grappling with the horrifying truth about release after witnessing his father kill the twin, leading to his decision to escape and change the community.",
      "word_count": 298
    },
    "resolution": {
      "chapter_range": "20-23",
      "primary_chapter": 21,
      "text": "Using his final strength, and a special knowledge that was deep inside him, Jonas found the sled that was waiting for them at the top of the hill. Numbly his hands fumbled for the rope. He settled himself on the sled and hugged Gabe close. The hill was steep but the snow was powdery and soft, and he knew that this time there would be no ice, no fall, no pain. Inside his freezing body, his heart surged with hope. They started down. Jonas felt himself losing consciousness and with his whole being willed himself to stay upright atop the sled, clutching Gabriel, keeping him safe. The runners sliced through the snow and the wind whipped at his face as they sped in a straight line through an incision that seemed to lead to the final destination, the place that he had always felt was waiting, the Elsewhere that held their future and their past. He forced his eyes open as they went downward, downward, sliding, and all at once he could see lights, and he recognized them now. He knew they were shining through the windows of rooms, that they were the red, blue, and yellow lights that twinkled from trees in places where families created and kept memories, where they celebrated love. Downward, downward, faster and faster. Suddenly he was aware with certainty and joy that below, ahead, they were waiting for him; and that they were waiting, too, for the baby. For the first time, he heard something that he knew to be music. He heard people singing. Behind him, across vast distances of space and time, from the place he had left, he thought he heard music too. But perhaps it was only an echo.",
      "rationale": "This concluding passage resolves Jonas's journey as he reaches Elsewhere with Gabriel, suggesting hope for both their future and the community they left behind, while the ambiguous ending leaves room for interpretation.",
      "word_count": 327
    }
  },
  "macro_variables": {
    "narrative": {
      "voice": {
        "pov": "TPL",
        "pov_description": "Third person limited through Jonas's perspective throughout - we see events filtered through his consciousness and understanding",
        "focalization": "INT",
        "focalization_description": "Internal focalization locked to Jonas - all information comes through his perceptions, thoughts, and emotional responses",
        "reliability": "REL",
        "temporal_distance": "IMM",
        "mode_dominance": "BAL",
        "character_revelation": "DRAM"
      },
      "structure": {
        "plot_architecture": "ARIST",
        "plot_architecture_description": "Classic Freytag structure with clear exposition (community setup), rising action (training begins), climax (memory sharing/revelation), falling action (crisis/decision), resolution (escape)",
        "chronology": "LIN",
        "causation": "TIGHT",
        "pacing_dominance": "SCENE"
      }
    },
    "rhetoric": {
      "alignment_type": "REINFORCING",
      "alignment_type_description": "Narrative structure and voice work in harmony to support the dystopian critique - linear progression mirrors Jonas's awakening, limited POV creates reader identification with discovery process",
      "dominant_mechanism": "PROGRESSIVE_REVELATION",
      "secondary_mechanism": "SYMPATHETIC_IDENTIFICATION",
      "alignment_strength": "STRONG"
    },
    "device_mediation": {
      "score": 0.85,
      "description": "Strong device mediation through symbolism (sled/snow as freedom), dramatic irony (reader learns alongside Jonas), and structural parallelism between Jonas's journey and reader's understanding. Devices reinforce rather than complicate the alignment."
    }
  },
  "micro_devices": [
    {
      "name": "Third-Person Limited Narration",
      "layer": "N",
      "function": "Me",
      "engagement": "T",
      "classification": "N|Me|T",
      "definition": "Narration limited to one character's perspective and knowledge",
      "student_facing_type": "Narrative Voice Device",
      "pedagogical_function": "Creates intimacy while maintaining narrative objectivity",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "exposition",
          "scene": "Jonas's fear about December",
          "chapter": 1,
          "page_range": "1-2",
          "quote_snippet": "Jonas was beginning to be frightened. No. Wrong word, Jonas thought."
        },
        {
          "freytag_section": "climax",
          "scene": "Memory transfer with Giver",
          "chapter": 11,
          "page_range": "103-104",
          "quote_snippet": "Jonas asked. 'I'd really like to. I think I could steer'"
        },
        {
          "freytag_section": "falling_action",
          "scene": "Jonas's emotional breakdown",
          "chapter": 20,
          "page_range": "165-166",
          "quote_snippet": "Jonas looked up wildly. 'No one heard that little twin cry'"
        }
      ]
    },
    {
      "name": "Internal Monologue",
      "layer": "N",
      "function": "Re",
      "engagement": "T",
      "classification": "N|Re|T",
      "definition": "Character's private thoughts revealed directly to reader",
      "student_facing_type": "Characterization Device",
      "pedagogical_function": "Reveals character's inner emotional and mental processes",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "exposition",
          "scene": "Jonas correcting his word choice",
          "chapter": 1,
          "page_range": "1",
          "quote_snippet": "No. Wrong word, Jonas thought. Frightened meant that deep, sickening feeling"
        },
        {
          "freytag_section": "rising_action",
          "scene": "Jonas remembering ceremonies",
          "chapter": 2,
          "page_range": "11-12",
          "quote_snippet": "He could remember the Decembers back to when he had become, well, probably a Four"
        }
      ]
    },
    {
      "name": "Symbolism",
      "layer": "B",
      "function": "Me",
      "engagement": "V",
      "classification": "B|Me|V",
      "definition": "Objects or actions representing deeper meanings or themes",
      "student_facing_type": "Figurative Language Device",
      "pedagogical_function": "Connects concrete narrative elements to abstract themes",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "climax",
          "scene": "Sled ride memory",
          "chapter": 11,
          "page_range": "103",
          "quote_snippet": "one ride, on one sled, in one snow, on one hill"
        },
        {
          "freytag_section": "resolution",
          "scene": "Final sled journey",
          "chapter": 23,
          "page_range": "178-179",
          "quote_snippet": "the sled that was waiting for them at the top of the hill"
        }
      ]
    },
    {
      "name": "Foreshadowing",
      "layer": "B",
      "function": "Re",
      "engagement": "V",
      "classification": "B|Re|V",
      "definition": "Hints or clues about future events in the story",
      "student_facing_type": "Temporal Device",
      "pedagogical_function": "Creates anticipation and thematic unity across narrative",
      "position_code": "CLUST-BEG",
      "examples": [
        {
          "freytag_section": "exposition",
          "scene": "Aircraft violation incident",
          "chapter": 1,
          "page_range": "2-3",
          "quote_snippet": "waiting, confused, for an explanation of the frightening event"
        },
        {
          "freytag_section": "rising_action",
          "scene": "December ceremony anticipation",
          "chapter": 2,
          "page_range": "9",
          "quote_snippet": "Each December brings such changes"
        }
      ]
    },
    {
      "name": "Metaphor",
      "layer": "B",
      "function": "Me",
      "engagement": "V",
      "classification": "B|Me|V",
      "definition": "Implicit comparison between unlike things without using 'like' or 'as'",
      "student_facing_type": "Figurative Language Device",
      "pedagogical_function": "Creates deeper meaning by connecting abstract concepts to concrete images",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "climax",
          "scene": "Giver discussing memory burden",
          "chapter": 11,
          "page_range": "104",
          "quote_snippet": "A little weight off this old body"
        },
        {
          "freytag_section": "resolution",
          "scene": "Final escape journey",
          "chapter": 23,
          "page_range": "179",
          "quote_snippet": "through an incision that seemed to lead to the final destination"
        }
      ]
    },
    {
      "name": "Dramatic Irony",
      "layer": "B",
      "function": "Te",
      "engagement": "V",
      "classification": "B|Te|V",
      "definition": "When readers know something that characters do not",
      "student_facing_type": "Irony Device",
      "pedagogical_function": "Creates tension and allows readers to understand themes characters miss",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "rising_action",
          "scene": "Family discussing ceremonies",
          "chapter": 2,
          "page_range": "11",
          "quote_snippet": "if none had been released"
        },
        {
          "freytag_section": "falling_action",
          "scene": "Jonas mimicking community voice",
          "chapter": 20,
          "page_range": "166",
          "quote_snippet": "I will kill people, sir. Old people? Small newborn people?"
        }
      ]
    },
    {
      "name": "Repetition",
      "layer": "R",
      "function": "Re",
      "engagement": "V",
      "classification": "R|Re|V",
      "definition": "Recurring words, phrases, or concepts for emphasis",
      "student_facing_type": "Sound Device",
      "pedagogical_function": "Emphasizes important themes and creates rhythm",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "climax",
          "scene": "Giver describing memory abundance",
          "chapter": 11,
          "page_range": "104",
          "quote_snippet": "one ride, on one sled, in one snow, on one hill"
        },
        {
          "freytag_section": "resolution",
          "scene": "Final descent",
          "chapter": 23,
          "page_range": "179",
          "quote_snippet": "Downward, downward, sliding... Downward, downward, faster and faster"
        }
      ]
    },
    {
      "name": "Imagery",
      "layer": "B",
      "function": "Re",
      "engagement": "T",
      "classification": "B|Re|T",
      "definition": "Vivid descriptive language appealing to the senses",
      "student_facing_type": "Figurative Language Device",
      "pedagogical_function": "Creates sensory experience and emotional connection for readers",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "exposition",
          "scene": "Aircraft description",
          "chapter": 1,
          "page_range": "2",
          "quote_snippet": "the sleek jet, almost a blur at its high speed"
        },
        {
          "freytag_section": "resolution",
          "scene": "Lights in distance",
          "chapter": 23,
          "page_range": "179",
          "quote_snippet": "red, blue, and yellow lights that twinkled from trees"
        },
        {
          "freytag_section": "climax",
          "scene": "Sled ride sensation",
          "chapter": 11,
          "page_range": "103",
          "quote_snippet": "powdery and soft"
        }
      ]
    },
    {
      "name": "Direct Dialogue",
      "layer": "N",
      "function": "Re",
      "engagement": "T",
      "classification": "N|Re|T",
      "definition": "Characters' exact spoken words presented in quotation marks",
      "student_facing_type": "Dialogue Device",
      "pedagogical_function": "Reveals character relationships and advances plot naturally",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "rising_action",
          "scene": "Family breakfast conversation",
          "chapter": 2,
          "page_range": "9",
          "quote_snippet": "Each December brings such changes"
        },
        {
          "freytag_section": "climax",
          "scene": "Jonas and Giver discussing memory",
          "chapter": 11,
          "page_range": "103-104",
          "quote_snippet": "Are you saying that I—I mean we—could do it again?"
        }
      ]
    },
    {
      "name": "Juxtaposition",
      "layer": "B",
      "function": "Te",
      "engagement": "V",
      "classification": "B|Te|V",
      "definition": "Placing contrasting elements side by side for comparison",
      "student_facing_type": "Contrast Device",
      "pedagogical_function": "Highlights differences to emphasize themes or create tension",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "falling_action",
          "scene": "Jonas contrasting responses",
          "chapter": 20,
          "page_range": "166",
          "quote_snippet": "I will take care of that, sir... I will kill people, sir"
        },
        {
          "freytag_section": "resolution",
          "scene": "Past and future together",
          "chapter": 23,
          "page_range": "179",
          "quote_snippet": "the Elsewhere that held their future and their past"
        }
      ]
    },
    {
      "name": "Personification",
      "layer": "B",
      "function": "Me",
      "engagement": "V",
      "classification": "B|Me|V",
      "definition": "Giving human qualities to non-human things",
      "student_facing_type": "Figurative Language Device",
      "pedagogical_function": "Makes abstract concepts more relatable and emotionally engaging",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "resolution",
          "scene": "Heart's emotional response",
          "chapter": 23,
          "page_range": "178",
          "quote_snippet": "his heart surged with hope"
        },
        {
          "freytag_section": "resolution",
          "scene": "Wind as active force",
          "chapter": 23,
          "page_range": "179",
          "quote_snippet": "the wind whipped at his face"
        }
      ]
    },
    {
      "name": "Scene",
      "layer": "N",
      "function": "Re",
      "engagement": "T",
      "classification": "N|Re|T",
      "definition": "Detailed, real-time narration of important moments",
      "student_facing_type": "Pacing Device",
      "pedagogical_function": "Slows narrative time to emphasize crucial events",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "climax",
          "scene": "Memory transfer experience",
          "chapter": 11,
          "page_range": "103-104",
          "quote_snippet": "lie back down. I want to—"
        },
        {
          "freytag_section": "falling_action",
          "scene": "Jonas's emotional breakdown",
          "chapter": 20,
          "page_range": "165-166",
          "quote_snippet": "Jonas sobbed and shouted and pounded the bed"
        }
      ]
    },
    {
      "name": "Climactic Structure",
      "layer": "N",
      "function": "Re",
      "engagement": "T",
      "classification": "N|Re|T",
      "definition": "Building tension toward a decisive turning point",
      "student_facing_type": "Structural Device",
      "pedagogical_function": "Creates narrative momentum and emotional peak",
      "position_code": "CLUST-MID",
      "examples": [
        {
          "freytag_section": "climax",
          "scene": "First memory experience",
          "chapter": 11,
          "page_range": "103",
          "quote_snippet": "I only wanted to begin by showing you how it works"
        },
        {
          "freytag_section": "resolution",
          "scene": "Final escape attempt",
          "chapter": 23,
          "page_range": "178-179",
          "quote_snippet": "Using his final strength, and a special knowledge"
        }
      ]
    },
    {
      "name": "Indirect Characterization",
      "layer": "N",
      "function": "Re",
      "engagement": "T",
      "classification": "N|Re|T",
      "definition": "Revealing character traits through actions, thoughts, and dialogue rather than direct description",
      "student_facing_type": "Characterization Device",
      "pedagogical_function": "Allows readers to discover character qualities naturally",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "exposition",
          "scene": "Jonas's careful word choice",
          "chapter": 1,
          "page_range": "1",
          "quote_snippet": "No. Wrong word, Jonas thought"
        },
        {
          "freytag_section": "falling_action",
          "scene": "Jonas's angry sarcasm",
          "chapter": 20,
          "page_range": "166",
          "quote_snippet": "I will kill people, sir... Thank you for your instructions, sir"
        }
      ]
    },
    {
      "name": "Alliteration",
      "layer": "R",
      "function": "Re",
      "engagement": "V",
      "classification": "R|Re|V",
      "definition": "Repetition of initial consonant sounds in consecutive words",
      "student_facing_type": "Sound Device",
      "pedagogical_function": "Creates rhythm and emphasizes important phrases",
      "position_code": "DIST",
      "examples": [
        {
          "freytag_section": "exposition",
          "scene": "Aircraft description",
          "chapter": 1,
          "page_range": "2",
          "quote_snippet": "blast of sound"
        },
        {
          "freytag_section": "rising_action",
          "scene": "Birth process description",
          "chapter": 2,
          "page_range": "12",
          "quote_snippet": "born in the previous year"
        }
      ]
    }
  ]
}